org-lessons/src/implementacion_series_formales.org
#+TITLE: Implementación en Python de series con grado o cogrado arbitrarios
#+AUTHOR: Marcos Bujosa
#+LANGUAGE: es
# +PROPERTY: header-args :exports both :results silent 
# +OPTIONS: toc:nil num:nil

# ###########
#+SETUPFILE: ../../css/readtheorg_inline.theme
# ###########

#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js

#+LATEX_HEADER_EXTRA: \usepackage{fullpage}


#+LATEX_HEADER_EXTRA: \usepackage[spanish]{babel}
#+LATEX_HEADER_EXTRA: \usepackage{lmodern}
#+LATEX_HEADER_EXTRA: \usepackage{tabularx}
#+LATEX_HEADER_EXTRA: \usepackage{booktabs}

#+LATEX: \maketitle

#+BEGIN_SRC emacs-lisp :exports none :results silent
(use-package ox-ipynb
  :load-path (lambda () (expand-file-name "ox-ipynb" scimax-dir)))
(use-package htmlize)
(org-babel-tangle)
#+END_SRC

#+LATEX: \maketitle

* Ejemplos de algunas series e inversas de series
   :PROPERTIES:
   :header-args: :tangle no
   :metadata: (slideshow . ((slide_type . skip)))
   :END:

** Inversa con final e inversa con principio de un polinomio de grado uno
   :PROPERTIES:
   :header-args: :tangle no
   :metadata: (slideshow . ((slide_type . skip)))
   :END:

#+attr_ipynb: (slideshow . ((slide_type . skip)))
Más abajo aparece una implementación en Python de las series con principio (con cogrado) y las series con final (con grado). Dicha implementación consiste en la definición de dos clases: la clase =SerieConPrincipio= y la clase =SerieConFinal=. 

#+attr_ipynb: (slideshow . ((slide_type . skip)))
El siguiente bloque de código es para que este cuaderno electrónico (notebook) lea el [[file:./implementacion_series_formales.py][implementacion_series_formales.py]] de python con la definición de ambas clases:
#+attr_ipynb: (slideshow . ((slide_type . skip)))
#+BEGIN_SRC jupyter-python :results silent
import warnings
warnings.filterwarnings("ignore", category=UserWarning)
%run -i implementacion_series_formales.py
#+END_SRC

#+attr_ipynb: (slideshow . ((slide_type . skip)))
Para mayor claridad, los ejemplos de más abajo usan un parámetro simbólico. El bloque de código que puede ver a continuación define un parámetro simbólico $a$.
#+attr_ipynb: (slideshow . ((slide_type . skip)))
#+BEGIN_SRC jupyter-python :results silent
from sympy import symbols
a = symbols('a')
#+END_SRC

*** Polinomio como =SerieConPrincipio= y su inversa
   :PROPERTIES:
   :metadata: (slideshow . ((slide_type . slide)))
   :END:
Definimos un polinomio de grado 1 como una =SerieConPrincipio= (con cogrado 0):
#+BEGIN_SRC jupyter-python #:display text/latex
p=SerieConPrincipio([1,-a],0)
p
#+END_SRC


Su inversa $p^{-\triangleright}$ (en el conjunto de series /con principio/) es:
#+BEGIN_SRC jupyter-python 
p.inversa()
#+END_SRC


Fíjese que su inversa (/con principio/) tiene cogrado -0. 

#+attr_ipynb: (slideshow . ((slide_type . skip)))
*Nota.* Al haber creado este polinomio como un elemento de la clase =SerieConPrincipio=, el procedimiento ~.inversa()~ genera la inversa como una serie con principio (con cogrado). A esta inversa la hemos denotado con $p^{-\triangleright}$ en la lección correspondiente.

#+attr_ipynb: (slideshow . ((slide_type . skip)))
Mediante gráficos podemos ver el comportamiento de los coeficientes para distintos valores del parámetro $a$. Para estos dibujos calcularemos 15 coeficientes y sustituiremos el parámetro $a$ por un ~valor~ concreto en cada caso.

**** Para valores de $a$ menores a 1 en valor absoluto (*raíz fuera del círculo unidad*)
   :PROPERTIES:
   :metadata: (slideshow . ((slide_type . subslide)))
   :END:

#+BEGIN_SRC jupyter-python 
valor = 0.8
p.inversa(15).subs((a,valor)).plot_serie(title='$a='+str(valor)+'$')
#+END_SRC



#+attr_ipynb: (slideshow . ((slide_type . subslide)))
#+BEGIN_SRC jupyter-python
valor = -0.8
p.inversa(15).subs((a,valor)).plot_serie(title='$a='+str(valor)+'$')
#+END_SRC



/Para polinomios con raíces fuera del círculo unidad los coeficientes de la inversa/ (con principio $p^{-\triangleright}$) /se aproximan a 0 cuando los índices crecen./ 

Éste es el caso en el que  $p^{-\triangleright}=p^{-1}$ (inversa absolutamente sumable).

**** Para valores de $a$ iguales a 1 en valor absoluto (*raíz sobre el círculo unidad*)
   :PROPERTIES:
   :metadata: (slideshow . ((slide_type . subslide)))
   :END:

#+BEGIN_SRC jupyter-python
valor = 1
p.inversa(15).subs((a,valor)).plot_serie(title='$a='+str(valor)+'$')
#+END_SRC




#+attr_ipynb: (slideshow . ((slide_type . subslide)))
#+BEGIN_SRC jupyter-python
valor = -1
p.inversa(15).subs((a,valor)).plot_serie(title='$a='+str(valor)+'$')
#+END_SRC



/Para polinomios con raíces en el círculo unidad los coeficientes de la inversa mantienen patrones estables./

