docs/org-lessons/src/implementacion_series_formales.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<!-- 2025-07-30 Wed 10:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Implementación en Python de series con grado o cogrado arbitrarios</title>
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Implementación en Python de series con grado o cogrado arbitrarios</h1>
<div id="table-of-contents" role="doc-toc">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7aad605">Ejemplos de algunas series e inversas de series</a>
<ul>
<li><a href="#org832a04c">Inversa con final e inversa con principio de un polinomio de grado uno</a>
<ul>
<li><a href="#orgc08a5b5">Polinomio como <code>SerieConPrincipio</code> y su inversa</a></li>
<li><a href="#org7d50e69">Polinomio como <code>SerieConFinal</code></a></li>
</ul>
</li>
<li><a href="#org0cdf7d1">Otro ejemplo de serie y dos inversas</a></li>
</ul>
</li>
<li><a href="#org3f405c8">Implementación de series con principio y series con final</a>
<ul>
<li><a href="#Clase-SerieConPrincipio">Clase <code>SerieConPrincipio</code>: series con cogrado arbitrario en Python</a>
<ul>
<li><a href="#org8a03aa8">Importación de librerías</a></li>
<li><a href="#orga9afe0f">Métodos generales para representar los objetos correctamente en Jupyter Notebook</a></li>
<li><a href="#orgdd4dcce">Declaración de la clase <code>SerieConPrincipio</code></a></li>
<li><a href="#org146691a">Constructor</a></li>
<li><a href="#orge619dce">Representaciones: texto y \(\LaTeX{}\)</a></li>
<li><a href="#org672d0eb">Suma de series</a></li>
<li><a href="#orge84229c">Producto: escalar y convolución</a></li>
<li><a href="#org2709062">Producto escalar desde la izquierda</a></li>
<li><a href="#org9938c86">Inversa formal</a></li>
<li><a href="#orgc1df97e">Gráfico de la serie</a></li>
<li><a href="#orge62221e">Sustitución simbólica</a></li>
<li><a href="#org709e826">Ejemplo de uso</a></li>
</ul>
</li>
<li><a href="#Clase-SerieConFinal">Clase <code>SerieConFinal</code>: series con grado arbitrario en python</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org7aad605" class="outline-2">
<h2 id="org7aad605">Ejemplos de algunas series e inversas de series</h2>
<div class="outline-text-2" id="text-org7aad605">
</div>
<div id="outline-container-org832a04c" class="outline-3">
<h3 id="org832a04c">Inversa con final e inversa con principio de un polinomio de grado uno</h3>
<div class="outline-text-3" id="text-org832a04c">
<p>
Más abajo aparece una implementación en Python de las series con principio (con cogrado) y las series con final (con grado). Dicha implementación consiste en la definición de dos clases: la clase <code>SerieConPrincipio</code> y la clase <code>SerieConFinal</code>. 
</p>

<p>
El siguiente bloque de código es para que este cuaderno electrónico (notebook) lea el <a href="./implementacion_series_formales.py">implementacion_series_formales.py</a> de python con la definición de ambas clases:
</p>
<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="font-weight: bold;">import</span> warnings
warnings.filterwarnings(<span style="font-style: italic;">"ignore"</span>, category=<span style="font-weight: bold; text-decoration: underline;">UserWarning</span>)
%run -i implementacion_series_formales.py
</code></pre>
</div>

<p>
Para mayor claridad, los ejemplos de más abajo usan un parámetro simbólico. El bloque de código que puede ver a continuación define un parámetro simbólico \(a\).
</p>
<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="font-weight: bold;">from</span> sympy <span style="font-weight: bold;">import</span> symbols
<span style="font-weight: bold; font-style: italic;">a</span> = symbols(<span style="font-style: italic;">'a'</span>)
</code></pre>
</div>
</div>
<div id="outline-container-orgc08a5b5" class="outline-4">
<h4 id="orgc08a5b5">Polinomio como <code>SerieConPrincipio</code> y su inversa</h4>
<div class="outline-text-4" id="text-orgc08a5b5">
<p>
Definimos un polinomio de grado 1 como una <code>SerieConPrincipio</code> (con cogrado 0):
</p>
<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="font-weight: bold; font-style: italic;">p</span>=SerieConPrincipio([1,-a],0)
p
</code></pre>
</div>


<p>
Su inversa \(p^{-\triangleright}\) (en el conjunto de series <i>con principio</i>) es:
</p>
<div class="org-src-container">
<pre class="src src-jupyter-python"><code>p.inversa()
</code></pre>
</div>


<p>
Fíjese que su inversa (<i>con principio</i>) tiene cogrado -0. 
</p>

<p>
<b>Nota.</b> Al haber creado este polinomio como un elemento de la clase <code>SerieConPrincipio</code>, el procedimiento <code>.inversa()</code> genera la inversa como una serie con principio (con cogrado). A esta inversa la hemos denotado con \(p^{-\triangleright}\) en la lección correspondiente.
</p>

<p>
Mediante gráficos podemos ver el comportamiento de los coeficientes para distintos valores del parámetro \(a\). Para estos dibujos calcularemos 15 coeficientes y sustituiremos el parámetro \(a\) por un <code>valor</code> concreto en cada caso.
</p>
</div>
<ul class="org-ul">
<li><a id="org95e055f"></a>Para valores de \(a\) menores a 1 en valor absoluto (<b>raíz fuera del círculo unidad</b>)<br />
<div class="outline-text-5" id="text-org95e055f">
<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="font-weight: bold; font-style: italic;">valor</span> = 0.8
p.inversa(15).subs((a,valor)).plot_serie(title=<span style="font-style: italic;">'$a='</span>+<span style="font-weight: bold;">str</span>(valor)+<span style="font-style: italic;">'$'</span>)
</code></pre>
</div>



<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="font-weight: bold; font-style: italic;">valor</span> = -0.8
p.inversa(15).subs((a,valor)).plot_serie(title=<span style="font-style: italic;">'$a='</span>+<span style="font-weight: bold;">str</span>(valor)+<span style="font-style: italic;">'$'</span>)
</code></pre>
</div>



<p>
<i>Para polinomios con raíces fuera del círculo unidad los coeficientes de la inversa</i> (con principio \(p^{-\triangleright}\)) <i>se aproximan a 0 cuando los índices crecen.</i> 
</p>

<p>
Éste es el caso en el que  \(p^{-\triangleright}=p^{-1}\) (inversa absolutamente sumable).
</p>
</div>
</li>
