org-lessons/src/implementacion_series_formales.org
**** Para valores de $a$ mayores a 1 en valor absoluto (*raíz en el interior del círculo unidad*)
   :PROPERTIES:
   :metadata: (slideshow . ((slide_type . subslide)))
   :END:

#+BEGIN_SRC jupyter-python
valor = 1.2
p.inversa(15).subs((a,valor)).plot_serie(title='$a='+str(valor)+'$')
#+END_SRC



#+attr_ipynb: (slideshow . ((slide_type . subslide)))
#+BEGIN_SRC jupyter-python
valor = -1.2
p.inversa(15).subs((a,valor)).plot_serie(title='$a='+str(valor)+'$')
#+END_SRC



/Para polinomios con raíces dentro del círculo unidad los coeficientes de la inversa/ (con principio $p^{-\triangleright}$) /crecen exponencialmente cuando los índices crecen./


#+attr_ipynb: (slideshow . ((slide_type . skip)))
Recuerde que *la inversa de un polinomio es una serie con infinitos términos*. Como esta implementación en Python solo calcula una cantidad finita de términos, el producto del polinomio por la serie calculada no es exactamente $1$, aunque nos podemos aproximar a la inversa tanto como queramos (dentro de las capacidades del ordenador). 

#+attr_ipynb: (slideshow . ((slide_type . skip)))
Si calculamos solo cinco términos de la inversa, se anulan todos los coeficientes excepto el quinto (y el $1$ de la posición $0$):
#+attr_ipynb: (slideshow . ((slide_type . skip)))
#+BEGIN_SRC jupyter-python
p * p.inversa()
#+END_SRC



#+attr_ipynb: (slideshow . ((slide_type . skip)))
Con solo cincuenta términos se anulan todos excepto el quincuagésimo (y el $1$ de la posición $0$):
#+attr_ipynb: (slideshow . ((slide_type . skip)))
#+BEGIN_SRC jupyter-python
p * p.inversa(50)
#+END_SRC



#+attr_ipynb: (slideshow . ((slide_type . skip)))
Con quinientos se anulan todos excepto el parámetro en la posición 500 (y el $1$ de la posición $0$):
#+attr_ipynb: (slideshow . ((slide_type . skip)))
#+BEGIN_SRC jupyter-python
p * p.inversa(500)
#+END_SRC



#+attr_ipynb: (slideshow . ((slide_type . skip)))
Fíjese que si $a\ne0$, el producto ~p*(p.inversa(500))~ no calcula exactamente la serie $1$ (la que tienen un $1$ en la posición $0$ y es nula en todas las demás posiciones). Nótese que la componente correspondiente a la posición 500 es distinta de cero (su magnitud es $a^{500}$). Por tanto, ~p.inversa(500)~ no es realmente la inversa de ~p~. Fíjese que la serie ~p.inversa(500)~ solo tiene 500 términos no nulos; sin embargo, la serie (con cogrado) que verdaderamente es inversa del polinomio ~p~ requiere de infinitos términos no nulos (algo que esta implementación en Python no calcula).

*** Polinomio como =SerieConFinal=
   :PROPERTIES:
   :metadata: (slideshow . ((slide_type . slide)))
   :END:

Ahora vamos a definir exactamente el mismo polinomio, pero en esta ocasión lo haremos como una =SerieConFinal= (con ~grado~ igual a 1).
#+BEGIN_SRC jupyter-python
p2=SerieConFinal([1,-a],1)
p2
#+END_SRC


Su inversa $p^{\blacktriangleleft-}$ (en el conjunto de series /con final/) es:
#+BEGIN_SRC jupyter-python
p2.inversa()
#+END_SRC



Fíjese que como el grado del polinomio ~p2~ es 1, el grado de $p^{\blacktriangleleft-}$ es $-1.$

#+attr_ipynb: (slideshow . ((slide_type . skip)))
*Nota.* Al haber creado este polinomio como un elemento de la clase =SerieConFinal=, el procedimiento ~.inversa()~ genera la inversa como una serie con final (con grado). A esta inversa la hemos denotado con $p^{\blacktriangleleft-}$ en la lección correspondiente.


#+attr_ipynb: (slideshow . ((slide_type . skip)))
Veamos con unos gráficos el comportamiento de los coeficientes de esta nueva inversa $p^{\blacktriangleleft-}$ para distintos valores del parámetro $a$.

**** Para valores de $a$ menores a 1 en valor absoluto (*raíz fuera del círculo unidad*)
   :PROPERTIES:
   :metadata: (slideshow . ((slide_type . subslide)))
   :END:

#+BEGIN_SRC jupyter-python
valor = 0.8
p2.inversa(15).subs((a,valor)).plot_serie(title='$a='+str(valor)+'$')
#+END_SRC



#+attr_ipynb: (slideshow . ((slide_type . subslide)))
#+BEGIN_SRC jupyter-python
valor = -0.8
p2.inversa(15).subs((a,valor)).plot_serie(title='$a='+str(valor)+'$')
#+END_SRC



/Para polinomios con raíces fuera del círculo unidad los coeficientes de la inversa/ (con final $p^{\blacktriangleleft-}$) /crecen exponencialmente cuando los índices decrecen./ 

**** Para valores de $a$ iguales a 1 en valor absoluto (*raíz sobre el círculo unidad*)
   :PROPERTIES:
   :metadata: (slideshow . ((slide_type . subslide)))
   :END:

#+BEGIN_SRC jupyter-python
valor = 1
p2.inversa(15).subs((a,valor)).plot_serie(title='$a='+str(valor)+'$')
#+END_SRC



#+attr_ipynb: (slideshow . ((slide_type . subslide)))
#+BEGIN_SRC jupyter-python
valor = -1
p2.inversa(15).subs((a,valor)).plot_serie(title='$a='+str(valor)+'$')
#+END_SRC



/Para polinomios con raíces en el círculo unidad los coeficientes de la inversa mantienen patrones estables./

**** Para valores de $a$ mayores a 1 en valor absoluto (*raíz en el interior del círculo unidad*)
   :PROPERTIES:
   :metadata: (slideshow . ((slide_type . subslide)))
   :END:

#+BEGIN_SRC jupyter-python
valor = 1.2
p2.inversa(15).subs((a,valor)).plot_serie(title='$a='+str(valor)+'$')
#+END_SRC



#+attr_ipynb: (slideshow . ((slide_type . subslide)))
#+BEGIN_SRC jupyter-python
valor = -1.2
p2.inversa(15).subs((a,valor)).plot_serie(title='$a='+str(valor)+'$')
#+END_SRC



/Para valores de $a$ mayores a 1 en valor absoluto los coeficientes de la inversa/ (con final $p^{\blacktriangleleft-}$) /se aproximan a 0 cuando los índices decrecen./ 

Este es el caso en el que  $p^{\blacktriangleleft-}=p^{-1}$ (inversa absolutamente sumable).


