docs/org-lessons/src/implementacion_series_formales.html
<li><a id="org0ef4225"></a>Para valores de \(a\) iguales a 1 en valor absoluto (<b>raíz sobre el círculo unidad</b>)<br />
<div class="outline-text-5" id="text-org0ef4225">
<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="font-weight: bold; font-style: italic;">valor</span> = 1
p.inversa(15).subs((a,valor)).plot_serie(title=<span style="font-style: italic;">'$a='</span>+<span style="font-weight: bold;">str</span>(valor)+<span style="font-style: italic;">'$'</span>)
</code></pre>
</div>




<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="font-weight: bold; font-style: italic;">valor</span> = -1
p.inversa(15).subs((a,valor)).plot_serie(title=<span style="font-style: italic;">'$a='</span>+<span style="font-weight: bold;">str</span>(valor)+<span style="font-style: italic;">'$'</span>)
</code></pre>
</div>



<p>
<i>Para polinomios con raíces en el círculo unidad los coeficientes de la inversa mantienen patrones estables.</i>
</p>
</div>
</li>
<li><a id="orgceafc52"></a>Para valores de \(a\) mayores a 1 en valor absoluto (<b>raíz en el interior del círculo unidad</b>)<br />
<div class="outline-text-5" id="text-orgceafc52">
<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="font-weight: bold; font-style: italic;">valor</span> = 1.2
p.inversa(15).subs((a,valor)).plot_serie(title=<span style="font-style: italic;">'$a='</span>+<span style="font-weight: bold;">str</span>(valor)+<span style="font-style: italic;">'$'</span>)
</code></pre>
</div>



<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="font-weight: bold; font-style: italic;">valor</span> = -1.2
p.inversa(15).subs((a,valor)).plot_serie(title=<span style="font-style: italic;">'$a='</span>+<span style="font-weight: bold;">str</span>(valor)+<span style="font-style: italic;">'$'</span>)
</code></pre>
</div>



<p>
<i>Para polinomios con raíces dentro del círculo unidad los coeficientes de la inversa</i> (con principio \(p^{-\triangleright}\)) <i>crecen exponencialmente cuando los índices crecen.</i>
</p>


<p>
Recuerde que <b>la inversa de un polinomio es una serie con infinitos términos</b>. Como esta implementación en Python solo calcula una cantidad finita de términos, el producto del polinomio por la serie calculada no es exactamente \(1\), aunque nos podemos aproximar a la inversa tanto como queramos (dentro de las capacidades del ordenador). 
</p>

<p>
Si calculamos solo cinco términos de la inversa, se anulan todos los coeficientes excepto el quinto (y el \(1\) de la posición \(0\)):
</p>
<div class="org-src-container">
<pre class="src src-jupyter-python"><code>p * p.inversa()
</code></pre>
</div>



<p>
Con solo cincuenta términos se anulan todos excepto el quincuagésimo (y el \(1\) de la posición \(0\)):
</p>
<div class="org-src-container">
<pre class="src src-jupyter-python"><code>p * p.inversa(50)
</code></pre>
</div>



<p>
Con quinientos se anulan todos excepto el parámetro en la posición 500 (y el \(1\) de la posición \(0\)):
</p>
<div class="org-src-container">
<pre class="src src-jupyter-python"><code>p * p.inversa(500)
</code></pre>
</div>



<p>
Fíjese que si \(a\ne0\), el producto <code>p*(p.inversa(500))</code> no calcula exactamente la serie \(1\) (la que tienen un \(1\) en la posición \(0\) y es nula en todas las demás posiciones). Nótese que la componente correspondiente a la posición 500 es distinta de cero (su magnitud es \(a^{500}\)). Por tanto, <code>p.inversa(500)</code> no es realmente la inversa de <code>p</code>. Fíjese que la serie <code>p.inversa(500)</code> solo tiene 500 términos no nulos; sin embargo, la serie (con cogrado) que verdaderamente es inversa del polinomio <code>p</code> requiere de infinitos términos no nulos (algo que esta implementación en Python no calcula).
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org7d50e69" class="outline-4">
<h4 id="org7d50e69">Polinomio como <code>SerieConFinal</code></h4>
<div class="outline-text-4" id="text-org7d50e69">
<p>
Ahora vamos a definir exactamente el mismo polinomio, pero en esta ocasión lo haremos como una <code>SerieConFinal</code> (con <code>grado</code> igual a 1).
</p>
<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="font-weight: bold; font-style: italic;">p2</span>=SerieConFinal([1,-a],1)
p2
</code></pre>
</div>


<p>
Su inversa \(p^{\blacktriangleleft-}\) (en el conjunto de series <i>con final</i>) es:
</p>
<div class="org-src-container">
<pre class="src src-jupyter-python"><code>p2.inversa()
</code></pre>
</div>



<p>
Fíjese que como el grado del polinomio <code>p2</code> es 1, el grado de \(p^{\blacktriangleleft-}\) es $-1.$
</p>

<p>
<b>Nota.</b> Al haber creado este polinomio como un elemento de la clase <code>SerieConFinal</code>, el procedimiento <code>.inversa()</code> genera la inversa como una serie con final (con grado). A esta inversa la hemos denotado con \(p^{\blacktriangleleft-}\) en la lección correspondiente.
</p>


<p>
Veamos con unos gráficos el comportamiento de los coeficientes de esta nueva inversa \(p^{\blacktriangleleft-}\) para distintos valores del parámetro \(a\).
</p>
</div>
<ul class="org-ul">
<li><a id="orgd01b4ec"></a>Para valores de \(a\) menores a 1 en valor absoluto (<b>raíz fuera del círculo unidad</b>)<br />
<div class="outline-text-5" id="text-orgd01b4ec">
<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="font-weight: bold; font-style: italic;">valor</span> = 0.8
p2.inversa(15).subs((a,valor)).plot_serie(title=<span style="font-style: italic;">'$a='</span>+<span style="font-weight: bold;">str</span>(valor)+<span style="font-style: italic;">'$'</span>)
</code></pre>
</div>



<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="font-weight: bold; font-style: italic;">valor</span> = -0.8
p2.inversa(15).subs((a,valor)).plot_serie(title=<span style="font-style: italic;">'$a='</span>+<span style="font-weight: bold;">str</span>(valor)+<span style="font-style: italic;">'$'</span>)
</code></pre>
</div>



<p>
<i>Para polinomios con raíces fuera del círculo unidad los coeficientes de la inversa</i> (con final \(p^{\blacktriangleleft-}\)) <i>crecen exponencialmente cuando los índices decrecen.</i> 
</p>
</div>
</li>
<li><a id="orga3cbfc5"></a>Para valores de \(a\) iguales a 1 en valor absoluto (<b>raíz sobre el círculo unidad</b>)<br />
<div class="outline-text-5" id="text-orga3cbfc5">
<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="font-weight: bold; font-style: italic;">valor</span> = 1
p2.inversa(15).subs((a,valor)).plot_serie(title=<span style="font-style: italic;">'$a='</span>+<span style="font-weight: bold;">str</span>(valor)+<span style="font-style: italic;">'$'</span>)
</code></pre>
</div>



<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="font-weight: bold; font-style: italic;">valor</span> = -1
p2.inversa(15).subs((a,valor)).plot_serie(title=<span style="font-style: italic;">'$a='</span>+<span style="font-weight: bold;">str</span>(valor)+<span style="font-style: italic;">'$'</span>)
</code></pre>
</div>



<p>
<i>Para polinomios con raíces en el círculo unidad los coeficientes de la inversa mantienen patrones estables.</i>
</p>
</div>
</li>
<li><a id="orgc918b83"></a>Para valores de \(a\) mayores a 1 en valor absoluto (<b>raíz en el interior del círculo unidad</b>)<br />
<div class="outline-text-5" id="text-orgc918b83">
<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="font-weight: bold; font-style: italic;">valor</span> = 1.2
p2.inversa(15).subs((a,valor)).plot_serie(title=<span style="font-style: italic;">'$a='</span>+<span style="font-weight: bold;">str</span>(valor)+<span style="font-style: italic;">'$'</span>)
</code></pre>
</div>



<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="font-weight: bold; font-style: italic;">valor</span> = -1.2
p2.inversa(15).subs((a,valor)).plot_serie(title=<span style="font-style: italic;">'$a='</span>+<span style="font-weight: bold;">str</span>(valor)+<span style="font-style: italic;">'$'</span>)
</code></pre>
</div>



<p>
<i>Para valores de \(a\) mayores a 1 en valor absoluto los coeficientes de la inversa</i> (con final \(p^{\blacktriangleleft-}\)) <i>se aproximan a 0 cuando los índices decrecen.</i> 
</p>

<p>
Este es el caso en el que  \(p^{\blacktriangleleft-}=p^{-1}\) (inversa absolutamente sumable).
</p>
</div>
</li>
</ul>
</div>
</div>
