org-lessons/src/implementacion_series_formales.org
** Otro ejemplo de serie y dos inversas
   :PROPERTIES:
   :metadata: (slideshow . ((slide_type . skip)))
   :END:

#+attr_ipynb: (slideshow . ((slide_type . skip)))
#+BEGIN_SRC jupyter-python
lista = [1, -.1, -.75]
s_cp = SerieConPrincipio(lista, -1)
s_cp
#+END_SRC



#+attr_ipynb: (slideshow . ((slide_type . skip)))
#+BEGIN_SRC jupyter-python
s_cp.inversa(30).plot_serie(title='inversa con principio de ' + s_cp._repr_latex_())
#+END_SRC



#+attr_ipynb: (slideshow . ((slide_type . skip)))
#+BEGIN_SRC jupyter-python
s_cf=SerieConFinal(lista, 1)
s_cf
#+END_SRC



#+attr_ipynb: (slideshow . ((slide_type . skip)))
#+BEGIN_SRC jupyter-python
s_cf.inversa(30).plot_serie(title='inversa con final de ' + s_cp._repr_latex_())
#+END_SRC



* Implementación de series con principio y series con final
   :PROPERTIES:
   :ID:       69899898-728e-42e8-b441-0b7cdcf8f75c
   :metadata: (slideshow . ((slide_type . slide)))
   :END:

#+BEGIN_SRC python :noweb yes :tangle ./implementacion_series_formales.py  :results none
<<imports>>
<<metodos-generales-representacion>>
<<SerieConPrincipio>>
    <<init-method>>
    <<repr-methods>>
    <<add-method>>
    <<mul-method>>
    <<rmul-method>>
    <<inversa-method>>
    <<plot_serie-method>>
    <<subs-method>>
<<SerieConFinal>>
#+END_SRC



** Clase =SerieConPrincipio=: series con cogrado arbitrario en Python
:PROPERTIES:
:CUSTOM_ID: Clase-SerieConPrincipio
:ID:       4c526014-caf8-4593-956c-d61ca63b13f1
:metadata: (slideshow . ((slide_type . skip)))
:END:

#+attr_ipynb: (slideshow . ((slide_type . skip)))
Este documento implementa en Python una clase llamada =SerieConPrincipio= que representa series formales con índice inicial (con cogrado) arbitrario y otra llamada =SerieConFinal= que representa series con índice final (con grado) arbitrario. Ello nos permitirá trabajar con series que comienzan, por ejemplo, en \( z^{-2} \) o \( z^3 \); y poder operar con ellas como si fueran polinomios infinitos, incluyendo suma, producto y cálculo de inversas. 

*** Importación de librerías
:PROPERTIES:
:metadata: (slideshow . ((slide_type . skip)))
:END:

#+attr_ipynb: (slideshow . ((slide_type . skip)))
Estas series podrán contener números racionales exactos (usando la clase ~Fraction~) o flotantes, así como parámetros simbólicos. Por ello
necesitamos ~latex~ y ~Rational~ de ~sympy~ para la representación como funciones generatrices en formato $\LaTeX{}$, y ~Fraction~ para mantener exactitud.
Con ~sympy~ podremos sustituir los parámetros simbólicos por valores concretos y con ~matplotlib.pyplot~ podremos representar gráficamente una parte de estas series.

#+attr_ipynb: (slideshow . ((slide_type . skip)))
#+name: imports
#+begin_src python :results none
from sympy import latex, Rational
from fractions import Fraction
import sympy
from sympy import Add
import matplotlib.pyplot as plt
from IPython.display import display, Math, display_png
import tempfile
from os.path import join           

#+end_src

*** Métodos generales para representar los objetos correctamente en Jupyter Notebook
:PROPERTIES:
:metadata: (slideshow . ((slide_type . skip)))
:END:

#+attr_ipynb: (slideshow . ((slide_type . skip)))
#+name: metodos-generales-representacion
#+BEGIN_SRC python :results none
def html(TeX):
    """ Plantilla HTML para insertar comandos LaTeX """
    return "<p style=\"text-align:center;\">$" + TeX + "$</p>"

def latex(a):
    """Método latex general"""
    try:
        return a.latex()
    except:
        return sympy.latex(a)

def pinta(data):
    """Muestra en Jupyter la representación latex de data"""
    display(Math(latex(data)))
    
#+END_SRC

*** Declaración de la clase =SerieConPrincipio=

Declaramos la clase =SerieConPrincipio= y la documentamos:

#+name: SerieConPrincipio
#+begin_src python :results none
class SerieConPrincipio:
    """
    Clase para representar series con un índice inicial arbitrario.

    Atributos:
    - coeficientes (list): Lista de coeficientes de la serie, sin ceros iniciales.
    - cogrado (int): Índice del primer coeficiente no nulo de la serie.
    - usa_float (bool): Indica si la serie opera con números flotantes.
    - final (bool): Indica si el final de la serie se representa con una elipsis.

    Métodos:
    - __repr__: Representa la serie como un par (cogrado, lista de coeficientes).
    - _repr_latex_: Representa la serie en formato LaTeX.
    - __add__: Suma dos SerieConPrincipio.
    - __mul__: Producto por un escalar o producto convolución entre SerieConPrincipio.
    - __rmul__: Producto por un escalar desde la izquierda.
    - inversa: Calcula la SerieConPrincipio inversa.
    """
#+end_src

*** Constructor

El constructor elimina ceros iniciales y ajusta el índice inicial (cogrado).

#+name: init-method
#+begin_src python :results none
def __init__(self, coeficientes, cogrado=0, final=False):
    primeros_no_nulos = next((i for i, c in enumerate(coeficientes) if c != 0), None)
    if primeros_no_nulos is None:
        self.coeficientes = []
        self.cogrado = 0
    else:
        self.coeficientes = coeficientes[primeros_no_nulos:]
        self.cogrado = cogrado + primeros_no_nulos

    self.final = final
    self.usa_float = any(isinstance(c, float) for c in self.coeficientes if not hasattr(c, 'is_number'))
    self.coeficientes = [
        float(c) if self.usa_float and isinstance(c, (int, float)) else Fraction(c) if isinstance(c, (int, float)) else c
        for c in self.coeficientes
    ]

#+end_src

