docs/org-lessons/src/implementacion_series_formales.html
<div id="outline-container-org0cdf7d1" class="outline-3">
<h3 id="org0cdf7d1">Otro ejemplo de serie y dos inversas</h3>
<div class="outline-text-3" id="text-org0cdf7d1">
<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="font-weight: bold; font-style: italic;">lista</span> = [1, -.1, -.75]
<span style="font-weight: bold; font-style: italic;">s_cp</span> = SerieConPrincipio(lista, -1)
s_cp
</code></pre>
</div>



<div class="org-src-container">
<pre class="src src-jupyter-python"><code>s_cp.inversa(30).plot_serie(title=<span style="font-style: italic;">'inversa con principio de '</span> + s_cp._repr_latex_())
</code></pre>
</div>



<div class="org-src-container">
<pre class="src src-jupyter-python"><code><span style="font-weight: bold; font-style: italic;">s_cf</span>=SerieConFinal(lista, 1)
s_cf
</code></pre>
</div>



<div class="org-src-container">
<pre class="src src-jupyter-python"><code>s_cf.inversa(30).plot_serie(title=<span style="font-style: italic;">'inversa con final de '</span> + s_cp._repr_latex_())
</code></pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org3f405c8" class="outline-2">
<h2 id="org3f405c8">Implementación de series con principio y series con final</h2>
<div class="outline-text-2" id="text-org3f405c8">
<div class="org-src-container">
<pre class="src src-python"><code><span style="font-weight: bold;">from</span> sympy <span style="font-weight: bold;">import</span> latex, Rational
<span style="font-weight: bold;">from</span> fractions <span style="font-weight: bold;">import</span> Fraction
<span style="font-weight: bold;">import</span> sympy
<span style="font-weight: bold;">from</span> sympy <span style="font-weight: bold;">import</span> Add
<span style="font-weight: bold;">import</span> matplotlib.pyplot <span style="font-weight: bold;">as</span> plt
<span style="font-weight: bold;">from</span> IPython.display <span style="font-weight: bold;">import</span> display, Math, display_png
<span style="font-weight: bold;">import</span> tempfile
<span style="font-weight: bold;">from</span> os.path <span style="font-weight: bold;">import</span> join           

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">html</span>(TeX):
    <span style="font-style: italic;">""" Plantilla HTML para insertar comandos LaTeX """</span>
    <span style="font-weight: bold;">return</span> <span style="font-style: italic;">"&lt;p style=\"text-align:center;\"&gt;$"</span> + TeX + <span style="font-style: italic;">"$&lt;/p&gt;"</span>

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">latex</span>(a):
    <span style="font-style: italic;">"""M&#233;todo latex general"""</span>
    <span style="font-weight: bold;">try</span>:
        <span style="font-weight: bold;">return</span> a.latex()
    <span style="font-weight: bold;">except</span>:
        <span style="font-weight: bold;">return</span> sympy.latex(a)

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">pinta</span>(data):
    <span style="font-style: italic;">"""Muestra en Jupyter la representaci&#243;n latex de data"""</span>
    display(Math(latex(data)))
    
<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">SerieConPrincipio</span>:
    <span style="font-style: italic;">"""
    Clase para representar series con un &#237;ndice inicial arbitrario.

    Atributos:
    - coeficientes (list): Lista de coeficientes de la serie, sin ceros iniciales.
    - cogrado (int): &#205;ndice del primer coeficiente no nulo de la serie.
    - usa_float (bool): Indica si la serie opera con n&#250;meros flotantes.
    - final (bool): Indica si el final de la serie se representa con una elipsis.

    M&#233;todos:
    - __repr__: Representa la serie como un par (cogrado, lista de coeficientes).
    - _repr_latex_: Representa la serie en formato LaTeX.
    - __add__: Suma dos SerieConPrincipio.
    - __mul__: Producto por un escalar o producto convoluci&#243;n entre SerieConPrincipio.
    - __rmul__: Producto por un escalar desde la izquierda.
    - inversa: Calcula la SerieConPrincipio inversa.
    """</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>, coeficientes, cogrado=0, final=<span style="font-weight: bold; text-decoration: underline;">False</span>):
        <span style="font-weight: bold; font-style: italic;">primeros_no_nulos</span> = <span style="font-weight: bold;">next</span>((i <span style="font-weight: bold;">for</span> i, c <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">enumerate</span>(coeficientes) <span style="font-weight: bold;">if</span> c != 0), <span style="font-weight: bold; text-decoration: underline;">None</span>)
        <span style="font-weight: bold;">if</span> primeros_no_nulos <span style="font-weight: bold;">is</span> <span style="font-weight: bold; text-decoration: underline;">None</span>:
            <span style="font-weight: bold;">self</span>.<span style="font-weight: bold; font-style: italic;">coeficientes</span> = []
            <span style="font-weight: bold;">self</span>.<span style="font-weight: bold; font-style: italic;">cogrado</span> = 0
        <span style="font-weight: bold;">else</span>:
            <span style="font-weight: bold;">self</span>.<span style="font-weight: bold; font-style: italic;">coeficientes</span> = coeficientes[primeros_no_nulos:]
            <span style="font-weight: bold;">self</span>.<span style="font-weight: bold; font-style: italic;">cogrado</span> = cogrado + primeros_no_nulos
    
        <span style="font-weight: bold;">self</span>.<span style="font-weight: bold; font-style: italic;">final</span> = final
        <span style="font-weight: bold;">self</span>.<span style="font-weight: bold; font-style: italic;">usa_float</span> = <span style="font-weight: bold;">any</span>(<span style="font-weight: bold;">isinstance</span>(c, <span style="font-weight: bold;">float</span>) <span style="font-weight: bold;">for</span> c <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.coeficientes <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">not</span> <span style="font-weight: bold;">hasattr</span>(c, <span style="font-style: italic;">'is_number'</span>))
        <span style="font-weight: bold;">self</span>.<span style="font-weight: bold; font-style: italic;">coeficientes</span> = [
            <span style="font-weight: bold;">float</span>(c) <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">self</span>.usa_float <span style="font-weight: bold;">and</span> <span style="font-weight: bold;">isinstance</span>(c, (<span style="font-weight: bold;">int</span>, <span style="font-weight: bold;">float</span>)) <span style="font-weight: bold;">else</span> Fraction(c) <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">isinstance</span>(c, (<span style="font-weight: bold;">int</span>, <span style="font-weight: bold;">float</span>)) <span style="font-weight: bold;">else</span> c
            <span style="font-weight: bold;">for</span> c <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.coeficientes
        ]
    
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__repr__</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-style: italic;">"""
        Representa la serie como un par (cogrado, lista de coeficientes).
    
        Retorna:
