docs/org-lessons/src/implementacion_series_formales.html
        - str: Representaci&#243;n de la serie como un par.
        """</span>
        <span style="font-weight: bold;">return</span> f<span style="font-style: italic;">"(</span>{<span style="font-weight: bold;">self</span>.cogrado}<span style="font-style: italic;">, </span>{<span style="font-weight: bold;">self</span>.coeficientes}<span style="font-style: italic;">)"</span>
    
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">latex</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-style: italic;">"""
        Representa la serie en formato LaTeX.
    
        Retorna:
        - str: Representaci&#243;n en formato LaTeX.
        """</span>
    
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">not</span> <span style="font-weight: bold;">self</span>.coeficientes:
            <span style="font-weight: bold;">return</span> <span style="font-style: italic;">"$0$"</span>
    
        <span style="font-weight: bold; font-style: italic;">terminos</span> = []
        <span style="font-weight: bold;">for</span> i, coef <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">enumerate</span>(<span style="font-weight: bold;">self</span>.coeficientes):
            <span style="font-weight: bold; font-style: italic;">indice</span> = <span style="font-weight: bold;">self</span>.cogrado + i
            <span style="font-weight: bold;">if</span> coef != 0:
                <span style="font-weight: bold; font-style: italic;">coef_sympy</span> = Rational(coef.numerator, coef.denominator) <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">isinstance</span>(coef, Fraction) <span style="font-weight: bold;">else</span> coef
                <span style="font-weight: bold; font-style: italic;">coef_latex</span> = r<span style="font-style: italic;">"\left("</span> + latex(coef_sympy) + r<span style="font-style: italic;">"\right)"</span> <span style="font-weight: bold;">if</span>  <span style="font-weight: bold;">isinstance</span>(coef_sympy, Add) <span style="font-weight: bold;">else</span> latex(coef_sympy)
                <span style="font-weight: bold;">if</span> coef_sympy == -1 <span style="font-weight: bold;">and</span> indice != 0:
                    <span style="font-weight: bold; font-style: italic;">coef_latex</span> = <span style="font-style: italic;">"-"</span>
                <span style="font-weight: bold;">if</span> coef_sympy == 1 <span style="font-weight: bold;">and</span> indice != 0:
                    <span style="font-weight: bold; font-style: italic;">coef_latex</span> = <span style="font-style: italic;">""</span>
                <span style="font-weight: bold;">if</span> indice == 0:
                    terminos.append(f<span style="font-style: italic;">"</span>{coef_latex}<span style="font-style: italic;">"</span>)
                <span style="font-weight: bold;">elif</span> indice == 1:
                    terminos.append(f<span style="font-style: italic;">"</span>{coef_latex}<span style="font-style: italic;">z"</span>)
                <span style="font-weight: bold;">else</span>:
                    terminos.append(f<span style="font-style: italic;">"</span>{coef_latex}<span style="font-style: italic;">z^{{</span>{indice}<span style="font-style: italic;">}}"</span>)  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Aseguramos que el exponente est&#233; entre llaves
</span>        <span style="font-weight: bold; font-style: italic;">cadena</span> = r<span style="font-style: italic;">' + \cdots'</span> <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">self</span>.final <span style="font-weight: bold;">else</span> <span style="font-style: italic;">''</span>
        <span style="font-weight: bold;">return</span> <span style="font-style: italic;">" + "</span>.join(terminos).replace(<span style="font-style: italic;">"+ -"</span>, <span style="font-style: italic;">"- "</span>) + cadena 
    
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">_repr_latex_</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-style: italic;">"""
        Representa la serie en formato LaTeX.
    
        Retorna:
        - str: Representaci&#243;n en formato LaTeX para notebooks de Jupyter.
        """</span>
        <span style="font-weight: bold;">return</span> <span style="font-style: italic;">'$'</span>+<span style="font-weight: bold;">self</span>.latex()+<span style="font-style: italic;">'$'</span>
    
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">_repr_html_</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-style: italic;">""" Construye la representaci&#243;n para el entorno jupyter notebook """</span>
        <span style="font-weight: bold;">return</span> html(<span style="font-weight: bold;">self</span>.latex())
    
    <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">def _repr_png_(self):
</span>    <span style="font-weight: bold; font-style: italic;">#    </span><span style="font-weight: bold; font-style: italic;">""" Representaci&#243;n png para el entorno jupyter en Emacs """
</span>    <span style="font-weight: bold; font-style: italic;">#    </span><span style="font-weight: bold; font-style: italic;">try:
</span>    <span style="font-weight: bold; font-style: italic;">#        </span><span style="font-weight: bold; font-style: italic;">expr = '$'+self.latex()+'$'
</span>    <span style="font-weight: bold; font-style: italic;">#        </span><span style="font-weight: bold; font-style: italic;">workdir = tempfile.mkdtemp()
</span>    <span style="font-weight: bold; font-style: italic;">#        </span><span style="font-weight: bold; font-style: italic;">with open(join(workdir, 'borrame.png'), 'wb') as outputfile:
</span>    <span style="font-weight: bold; font-style: italic;">#            </span><span style="font-weight: bold; font-style: italic;">sympy.preview(expr, viewer='BytesIO', outputbuffer=outputfile)
</span>    <span style="font-weight: bold; font-style: italic;">#        </span><span style="font-weight: bold; font-style: italic;">return open(join(workdir, 'borrame.png'),'rb').read()
</span>    <span style="font-weight: bold; font-style: italic;">#    </span><span style="font-weight: bold; font-style: italic;">except:
</span>    <span style="font-weight: bold; font-style: italic;">#        </span><span style="font-weight: bold; font-style: italic;">return '$'+self.latex()+'$'
</span>        
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__add__</span>(<span style="font-weight: bold;">self</span>, otra):
        <span style="font-style: italic;">"""
        Suma dos series.
    
        Par&#225;metros:
        - otra (SerieConPrincipio): Otra serie.
    
        Retorna:
        - SerieConPrincipio: La serie resultante de la suma.
        """</span>
        <span style="font-weight: bold; font-style: italic;">cogrado</span> = <span style="font-weight: bold;">min</span>(<span style="font-weight: bold;">self</span>.cogrado, otra.cogrado)
        <span style="font-weight: bold; font-style: italic;">indice_final</span> = <span style="font-weight: bold;">max</span>(
            <span style="font-weight: bold;">self</span>.cogrado + <span style="font-weight: bold;">len</span>(<span style="font-weight: bold;">self</span>.coeficientes),
            otra.cogrado + <span style="font-weight: bold;">len</span>(otra.coeficientes),
        )
        <span style="font-weight: bold; font-style: italic;">coeficientes</span> = []
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(cogrado, indice_final):
            <span style="font-weight: bold; font-style: italic;">coef1</span> = <span style="font-weight: bold;">self</span>.coeficientes[i - <span style="font-weight: bold;">self</span>.cogrado] <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">self</span>.cogrado &lt;= i &lt; <span style="font-weight: bold;">self</span>.cogrado + <span style="font-weight: bold;">len</span>(<span style="font-weight: bold;">self</span>.coeficientes) <span style="font-weight: bold;">else</span> 0
            <span style="font-weight: bold; font-style: italic;">coef2</span> = otra.coeficientes[i - otra.cogrado] <span style="font-weight: bold;">if</span> otra.cogrado &lt;= i &lt; otra.cogrado + <span style="font-weight: bold;">len</span>(otra.coeficientes) <span style="font-weight: bold;">else</span> 0
            coeficientes.append(coef1 + coef2)
        <span style="font-weight: bold;">return</span> SerieConPrincipio(coeficientes, cogrado)
    
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__mul__</span>(<span style="font-weight: bold;">self</span>, escalar_o_otra):
        <span style="font-style: italic;">"""
