docs/org-lessons/src/implementacion_series_formales.html
        Producto por un escalar o producto convoluci&#243;n entre series.
    
        Par&#225;metros:
        - escalar_o_otra (float | SerieConPrincipio): Escalar o otra serie.
    
        Retorna:
        - SerieConPrincipio: La serie resultante del producto.
        """</span>
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">isinstance</span>(escalar_o_otra, (<span style="font-weight: bold;">int</span>, <span style="font-weight: bold;">float</span>, Fraction)):
            <span style="font-weight: bold; font-style: italic;">coeficientes</span> = [coef * escalar_o_otra <span style="font-weight: bold;">for</span> coef <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.coeficientes]
            <span style="font-weight: bold;">return</span> SerieConPrincipio(coeficientes, <span style="font-weight: bold;">self</span>.cogrado)
        <span style="font-weight: bold;">elif</span> <span style="font-weight: bold;">isinstance</span>(escalar_o_otra, SerieConPrincipio):
            <span style="font-weight: bold; font-style: italic;">cogrado</span> = <span style="font-weight: bold;">self</span>.cogrado + escalar_o_otra.cogrado
            <span style="font-weight: bold; font-style: italic;">coeficientes</span> = [0.0 <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">self</span>.usa_float <span style="font-weight: bold;">else</span> Fraction(0)] * (<span style="font-weight: bold;">len</span>(<span style="font-weight: bold;">self</span>.coeficientes) + <span style="font-weight: bold;">len</span>(escalar_o_otra.coeficientes) - 1)
            <span style="font-weight: bold;">for</span> i, coef1 <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">enumerate</span>(<span style="font-weight: bold;">self</span>.coeficientes):
                <span style="font-weight: bold;">for</span> j, coef2 <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">enumerate</span>(escalar_o_otra.coeficientes):
                    <span style="font-weight: bold; font-style: italic;">coeficientes</span>[i + j] += coef1 * coef2
            <span style="font-weight: bold;">return</span> SerieConPrincipio(coeficientes, cogrado)
        <span style="font-weight: bold;">else</span>:
            <span style="font-weight: bold;">raise</span> <span style="font-weight: bold; text-decoration: underline;">TypeError</span>(<span style="font-style: italic;">"El operador * solo admite un escalar o otra SerieConPrincipio."</span>)
    
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__rmul__</span>(<span style="font-weight: bold;">self</span>, escalar):
        <span style="font-style: italic;">"""
        Producto por un escalar desde la izquierda.
    
        Par&#225;metros:
        - escalar (float): Escalar para multiplicar la serie.
    
        Retorna:
        - SerieConPrincipio: La serie resultante del producto.
        """</span>
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">self</span>.__mul__(escalar)
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">inversa</span>(<span style="font-weight: bold;">self</span>, num_terminos=5):
        <span style="font-style: italic;">"""
        Calcula la inversa de la serie.
    
        Par&#225;metros:
        - num_terminos (int): N&#250;mero de t&#233;rminos de la inversa a calcular.
    
        Retorna:
        - SerieConPrincipio: La serie inversa.
        """</span>
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">not</span> <span style="font-weight: bold;">self</span>.coeficientes <span style="font-weight: bold;">or</span> <span style="font-weight: bold;">self</span>.coeficientes[0] == 0:
            <span style="font-weight: bold;">raise</span> <span style="font-weight: bold; text-decoration: underline;">ValueError</span>(<span style="font-style: italic;">"La primera componente no nula debe ser distinta de cero."</span>)
    
        <span style="font-weight: bold; font-style: italic;">b</span> = [0.0 <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">self</span>.usa_float <span style="font-weight: bold;">else</span> 0] * num_terminos
        <span style="font-weight: bold; font-style: italic;">a0</span> = <span style="font-weight: bold;">self</span>.coeficientes[0]
    
        <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">self</span>.usa_float:
            <span style="font-weight: bold; font-style: italic;">b</span>[0] = 1.0 / a0
        <span style="font-weight: bold;">else</span>:
            <span style="font-weight: bold;">try</span>:
                <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">isinstance</span>(a0, (<span style="font-weight: bold;">int</span>, Fraction)):
                    <span style="font-weight: bold; font-style: italic;">b</span>[0] = Fraction(1, a0)
                <span style="font-weight: bold;">else</span>:
                    <span style="font-weight: bold; font-style: italic;">b</span>[0] = 1 / a0
            <span style="font-weight: bold;">except</span> <span style="font-weight: bold; text-decoration: underline;">Exception</span> <span style="font-weight: bold;">as</span> e:
                <span style="font-weight: bold;">raise</span> <span style="font-weight: bold; text-decoration: underline;">ValueError</span>(f<span style="font-style: italic;">"No se pudo calcular el inverso del t&#233;rmino inicial </span>{a0}<span style="font-style: italic;">: </span>{e}<span style="font-style: italic;">"</span>)
    
        <span style="font-weight: bold;">for</span> j <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(1, num_terminos):
            <span style="font-weight: bold; font-style: italic;">suma</span> = <span style="font-weight: bold;">sum</span>(
                b[r] * <span style="font-weight: bold;">self</span>.coeficientes[j - r]
                <span style="font-weight: bold;">for</span> r <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(j)
                <span style="font-weight: bold;">if</span> j - r &lt; <span style="font-weight: bold;">len</span>(<span style="font-weight: bold;">self</span>.coeficientes)
            )
            <span style="font-weight: bold; font-style: italic;">b</span>[j] = -b[0] * suma
       
        <span style="font-weight: bold;">return</span> SerieConPrincipio(b, -<span style="font-weight: bold;">self</span>.cogrado, final=<span style="font-weight: bold; text-decoration: underline;">True</span>)
    
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">plot_serie</span>(serie, title=<span style="font-style: italic;">"Serie con principio (con cogrado)"</span>):
        <span style="font-style: italic;">"""
        Dibuja la serie como un gr&#225;fico de barras.
        """</span>
        <span style="font-weight: bold; font-style: italic;">indices</span> = <span style="font-weight: bold;">range</span>(serie.cogrado, serie.cogrado + <span style="font-weight: bold;">len</span>(serie.coeficientes))
        <span style="font-weight: bold; font-style: italic;">valores</span> = serie.coeficientes
        plt.figure(figsize=(8, 4))
        <span style="font-weight: bold; font-style: italic;">#</span><span style="font-weight: bold; font-style: italic;">plt.bar(indices, valores, width=0.5, color='skyblue', edgecolor='k')
</span>        plt.stem(indices, valores)
        plt.axhline(0, color=<span style="font-style: italic;">'black'</span>, linewidth=0.8)
        plt.xticks(indices, [<span style="font-weight: bold;">str</span>(<span style="font-weight: bold;">int</span>(idx)) <span style="font-weight: bold;">for</span> idx <span style="font-weight: bold;">in</span> indices]) <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Asegura que las etiquetas sean enteras
</span>        plt.xlabel(<span style="font-style: italic;">"&#205;ndice"</span>)
        plt.ylabel(<span style="font-style: italic;">"Valor"</span>)
        plt.title(title)
        plt.show()
    
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">subs</span>(<span style="font-weight: bold;">self</span>, reglasDeSustitucion=[]):
        <span style="font-style: italic;">""" Sustituci&#243;n de variables simb&#243;licas """</span>
    
        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">CreaLista</span>(t):
            <span style="font-style: italic;">"""Devuelve t si t es una lista; si no devuelve la lista [t]"""</span>
            <span style="font-weight: bold;">return</span> t <span style="font-weight: bold;">if</span> <span style="font-weight: bold;">isinstance</span>(t, <span style="font-weight: bold;">list</span>) <span style="font-weight: bold;">else</span> [t]
    
        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">sustitucion</span>(elemento, regla_de_sustitucion):
            <span style="font-weight: bold;">return</span> sympy.S(elemento).subs(CreaLista(regla_de_sustitucion))
            
        <span style="font-weight: bold; font-style: italic;">coeficientes</span> = [sustitucion(elemento, reglasDeSustitucion) <span style="font-weight: bold;">for</span> elemento <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">self</span>.coeficientes]
        <span style="font-weight: bold;">return</span> SerieConPrincipio(coeficientes, <span style="font-weight: bold;">self</span>.cogrado)    
